ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DB64def.inc
.equ USART5_RXDATAL = 0x08A0             ; Receive Data Low Byte
.equ USART5_RXDATAH = 0x08A1             ; Receive Data High Byte
.equ USART5_TXDATAL = 0x08A2             ; Transmit Data Low Byte
.equ USART5_TXDATAH = 0x08A3             ; Transmit Data High Byte
.equ USART5_STATUS = 0x08A4              ; Status
.equ USART5_CTRLA = 0x08A5               ; Control A
.equ USART5_CTRLB = 0x08A6               ; Control B
.equ USART5_CTRLC = 0x08A7               ; Control C
.equ USART5_BAUD = 0x08A8                ; Baud Rate
.equ USART5_BAUDL = 0x08A8               ; Baud Rate low byte
.equ USART5_BAUDH = 0x08A9               ; Baud Rate hi byte
.equ USART5_CTRLD = 0x08AA               ; Control D
.equ USART5_DBGCTRL = 0x08AB             ; Debug Control
.equ USART5_EVCTRL = 0x08AC              ; Event Control
.equ USART5_TXPLCTRL = 0x08AD            ; IRCOM Transmitter Pulse Length Control
.equ USART5_RXPLCTRL = 0x08AE            ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USERROW - User Row
;*************************************************************************

.equ USERROW_USERROW0 = 0x1080           ; User Row Byte 0
.equ USERROW_USERROW1 = 0x1081           ; User Row Byte 1
.equ USERROW_USERROW2 = 0x1082           ; User Row Byte 2
.equ USERROW_USERROW3 = 0x1083           ; User Row Byte 3
.equ USERROW_USERROW4 = 0x1084           ; User Row Byte 4
.equ USERROW_USERROW5 = 0x1085           ; User Row Byte 5
.equ USERROW_USERROW6 = 0x1086           ; User Row Byte 6
.equ USERROW_USERROW7 = 0x1087           ; User Row Byte 7
.equ USERROW_USERROW8 = 0x1088           ; User Row Byte 8
.equ USERROW_USERROW9 = 0x1089           ; User Row Byte 9
.equ USERROW_USERROW10 = 0x108A          ; User Row Byte 10
.equ USERROW_USERROW11 = 0x108B          ; User Row Byte 11
.equ USERROW_USERROW12 = 0x108C          ; User Row Byte 12
.equ USERROW_USERROW13 = 0x108D          ; User Row Byte 13
.equ USERROW_USERROW14 = 0x108E          ; User Row Byte 14
.equ USERROW_USERROW15 = 0x108F          ; User Row Byte 15
.equ USERROW_USERROW16 = 0x1090          ; User Row Byte 16
.equ USERROW_USERROW17 = 0x1091          ; User Row Byte 17
.equ USERROW_USERROW18 = 0x1092          ; User Row Byte 18
.equ USERROW_USERROW19 = 0x1093          ; User Row Byte 19
.equ USERROW_USERROW20 = 0x1094          ; User Row Byte 20
.equ USERROW_USERROW21 = 0x1095          ; User Row Byte 21
.equ USERROW_USERROW22 = 0x1096          ; User Row Byte 22
.equ USERROW_USERROW23 = 0x1097          ; User Row Byte 23
.equ USERROW_USERROW24 = 0x1098          ; User Row Byte 24
.equ USERROW_USERROW25 = 0x1099          ; User Row Byte 25
.equ USERROW_USERROW26 = 0x109A          ; User Row Byte 26
.equ USERROW_USERROW27 = 0x109B          ; User Row Byte 27
.equ USERROW_USERROW28 = 0x109C          ; User Row Byte 28
.equ USERROW_USERROW29 = 0x109D          ; User Row Byte 29
.equ USERROW_USERROW30 = 0x109E          ; User Row Byte 30
.equ USERROW_USERROW31 = 0x109F          ; User Row Byte 31

;*************************************************************************
;** VPORTA - Virtual Ports
;*************************************************************************

.equ VPORTA_DIR = 0x0000                 ; Data Direction
.equ VPORTA_OUT = 0x0001                 ; Output Value
.equ VPORTA_IN = 0x0002                  ; Input Value
.equ VPORTA_INTFLAGS = 0x0003            ; Interrupt Flags

;*************************************************************************
;** VPORTB - Virtual Ports
;*************************************************************************

.equ VPORTB_DIR = 0x0004                 ; Data Direction
.equ VPORTB_OUT = 0x0005                 ; Output Value
.equ VPORTB_IN = 0x0006                  ; Input Value
.equ VPORTB_INTFLAGS = 0x0007            ; Interrupt Flags

;*************************************************************************
;** VPORTC - Virtual Ports
;*************************************************************************

.equ VPORTC_DIR = 0x0008                 ; Data Direction
.equ VPORTC_OUT = 0x0009                 ; Output Value
.equ VPORTC_IN = 0x000A                  ; Input Value
.equ VPORTC_INTFLAGS = 0x000B            ; Interrupt Flags

;*************************************************************************
;** VPORTD - Virtual Ports
;*************************************************************************

.equ VPORTD_DIR = 0x000C                 ; Data Direction
.equ VPORTD_OUT = 0x000D                 ; Output Value
.equ VPORTD_IN = 0x000E                  ; Input Value
.equ VPORTD_INTFLAGS = 0x000F            ; Interrupt Flags

;*************************************************************************
;** VPORTE - Virtual Ports
;*************************************************************************

.equ VPORTE_DIR = 0x0010                 ; Data Direction
.equ VPORTE_OUT = 0x0011                 ; Output Value
.equ VPORTE_IN = 0x0012                  ; Input Value
.equ VPORTE_INTFLAGS = 0x0013            ; Interrupt Flags

;*************************************************************************
;** VPORTF - Virtual Ports
;*************************************************************************

.equ VPORTF_DIR = 0x0014                 ; Data Direction
.equ VPORTF_OUT = 0x0015                 ; Output Value
.equ VPORTF_IN = 0x0016                  ; Input Value
.equ VPORTF_INTFLAGS = 0x0017            ; Interrupt Flags

;*************************************************************************
;** VPORTG - Virtual Ports
;*************************************************************************

.equ VPORTG_DIR = 0x0018                 ; Data Direction
.equ VPORTG_OUT = 0x0019                 ; Output Value
.equ VPORTG_IN = 0x001A                  ; Input Value
.equ VPORTG_INTFLAGS = 0x001B            ; Interrupt Flags

;*************************************************************************
;** VREF - Voltage reference
;*************************************************************************

.equ VREF_ADC0REF = 0x00B0               ; ADC0 Reference
.equ VREF_DAC0REF = 0x00B2               ; DAC0 Reference
.equ VREF_ACREF = 0x00B4                 ; AC Reference

;*************************************************************************
;** WDT - Watch-Dog Timer
;*************************************************************************

.equ WDT_CTRLA = 0x0100                  ; Control A
.equ WDT_STATUS = 0x0101                 ; Status

;*************************************************************************
;** ZCD0 - Zero Cross Detect
;*************************************************************************

.equ ZCD0_CTRLA = 0x06C0                 ; Control A
.equ ZCD0_INTCTRL = 0x06C2               ; Interrupt Control
.equ ZCD0_STATUS = 0x06C3                ; Status

;*************************************************************************
;** ZCD1 - Zero Cross Detect
;*************************************************************************

.equ ZCD1_CTRLA = 0x06C8                 ; Control A
.equ ZCD1_INTCTRL = 0x06CA               ; Interrupt Control
.equ ZCD1_STATUS = 0x06CB                ; Status

;*************************************************************************
;** ZCD2 - Zero Cross Detect
;*************************************************************************

.equ ZCD2_CTRLA = 0x06D0                 ; Control A
.equ ZCD2_INTCTRL = 0x06D2               ; Interrupt Control
.equ ZCD2_STATUS = 0x06D3                ; Status


; ***** ALL MODULE BASE ADRESSES *****************************************

