ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DB64def.inc
; OPAMP_OP0SETTLE masks
.equ OPAMP_SETTLE_gm = 0x7F              ; Settle Time group mask
.equ OPAMP_SETTLE_gp = 0                 ; Settle Time group position
.equ OPAMP_SETTLE_0_bm = (1<<0)          ; Settle Time bit 0 mask
.equ OPAMP_SETTLE_0_bp = 0               ; Settle Time bit 0 position
.equ OPAMP_SETTLE_1_bm = (1<<1)          ; Settle Time bit 1 mask
.equ OPAMP_SETTLE_1_bp = 1               ; Settle Time bit 1 position
.equ OPAMP_SETTLE_2_bm = (1<<2)          ; Settle Time bit 2 mask
.equ OPAMP_SETTLE_2_bp = 2               ; Settle Time bit 2 position
.equ OPAMP_SETTLE_3_bm = (1<<3)          ; Settle Time bit 3 mask
.equ OPAMP_SETTLE_3_bp = 3               ; Settle Time bit 3 position
.equ OPAMP_SETTLE_4_bm = (1<<4)          ; Settle Time bit 4 mask
.equ OPAMP_SETTLE_4_bp = 4               ; Settle Time bit 4 position
.equ OPAMP_SETTLE_5_bm = (1<<5)          ; Settle Time bit 5 mask
.equ OPAMP_SETTLE_5_bp = 5               ; Settle Time bit 5 position
.equ OPAMP_SETTLE_6_bm = (1<<6)          ; Settle Time bit 6 mask
.equ OPAMP_SETTLE_6_bp = 6               ; Settle Time bit 6 position

; OPAMP_OP0CAL masks
.equ OPAMP_CAL_gm = 0xFF                 ; Calibration (for input offset voltage) group mask
.equ OPAMP_CAL_gp = 0                    ; Calibration (for input offset voltage) group position
.equ OPAMP_CAL_0_bm = (1<<0)             ; Calibration (for input offset voltage) bit 0 mask
.equ OPAMP_CAL_0_bp = 0                  ; Calibration (for input offset voltage) bit 0 position
.equ OPAMP_CAL_1_bm = (1<<1)             ; Calibration (for input offset voltage) bit 1 mask
.equ OPAMP_CAL_1_bp = 1                  ; Calibration (for input offset voltage) bit 1 position
.equ OPAMP_CAL_2_bm = (1<<2)             ; Calibration (for input offset voltage) bit 2 mask
.equ OPAMP_CAL_2_bp = 2                  ; Calibration (for input offset voltage) bit 2 position
.equ OPAMP_CAL_3_bm = (1<<3)             ; Calibration (for input offset voltage) bit 3 mask
.equ OPAMP_CAL_3_bp = 3                  ; Calibration (for input offset voltage) bit 3 position
.equ OPAMP_CAL_4_bm = (1<<4)             ; Calibration (for input offset voltage) bit 4 mask
.equ OPAMP_CAL_4_bp = 4                  ; Calibration (for input offset voltage) bit 4 position
.equ OPAMP_CAL_5_bm = (1<<5)             ; Calibration (for input offset voltage) bit 5 mask
.equ OPAMP_CAL_5_bp = 5                  ; Calibration (for input offset voltage) bit 5 position
.equ OPAMP_CAL_6_bm = (1<<6)             ; Calibration (for input offset voltage) bit 6 mask
.equ OPAMP_CAL_6_bp = 6                  ; Calibration (for input offset voltage) bit 6 position
.equ OPAMP_CAL_7_bm = (1<<7)             ; Calibration (for input offset voltage) bit 7 mask
.equ OPAMP_CAL_7_bp = 7                  ; Calibration (for input offset voltage) bit 7 position

; OPAMP_OP1CTRLA masks
; Masks for OPAMP_ALWAYSON already defined
; Masks for OPAMP_EVENTEN already defined
; Masks for OPAMP_OUTMODE already defined
; Masks for OPAMP_RUNSTBY already defined

; OPAMP_OP1STATUS masks
; Masks for OPAMP_SETTLED already defined

; OPAMP_OP1RESMUX masks
; Masks for OPAMP_MUXTOP already defined
; Masks for OPAMP_MUXBOT already defined
; Masks for OPAMP_MUXWIP already defined

; OPAMP_OP1INMUX masks
; Masks for OPAMP_MUXPOS already defined
; Masks for OPAMP_MUXNEG already defined

; OPAMP_OP1SETTLE masks
; Masks for OPAMP_SETTLE already defined

; OPAMP_OP1CAL masks
; Masks for OPAMP_CAL already defined

; OPAMP_OP2CTRLA masks
; Masks for OPAMP_ALWAYSON already defined
; Masks for OPAMP_EVENTEN already defined
; Masks for OPAMP_OUTMODE already defined
; Masks for OPAMP_RUNSTBY already defined

; OPAMP_OP2STATUS masks
; Masks for OPAMP_SETTLED already defined

; OPAMP_OP2RESMUX masks
; Masks for OPAMP_MUXTOP already defined
; Masks for OPAMP_MUXBOT already defined
; Masks for OPAMP_MUXWIP already defined

; OPAMP_OP2INMUX masks
; Masks for OPAMP_MUXPOS already defined
; Masks for OPAMP_MUXNEG already defined

; OPAMP_OP2SETTLE masks
; Masks for OPAMP_SETTLE already defined

; OPAMP_OP2CAL masks
; Masks for OPAMP_CAL already defined

; Output Mode select
.equ OPAMP_OUTMODE_OFF_gc = (0x00<<2)    ; Output Driver Off
.equ OPAMP_OUTMODE_NORMAL_gc = (0x01<<2) ; Output Driver in Normal Mode

; Negative Input Multiplexer select
.equ OPAMP_MUXNEG_INN_gc = (0x00<<4)     ; Negative input pin for OPn
.equ OPAMP_MUXNEG_WIP_gc = (0x01<<4)     ; Wiper from OPn's resistor ladder
.equ OPAMP_MUXNEG_OUT_gc = (0x02<<4)     ; OPn output (unity gain)
.equ OPAMP_MUXNEG_DAC_gc = (0x03<<4)     ; DAC output

; Positive Input Multiplexer select
.equ OPAMP_MUXPOS_INP_gc = (0x00<<0)     ; Positive input pin for OPn
.equ OPAMP_MUXPOS_WIP_gc = (0x01<<0)     ; Wiper from OPn's resistor ladder
.equ OPAMP_MUXPOS_DAC_gc = (0x02<<0)     ; DAC output
.equ OPAMP_MUXPOS_GND_gc = (0x03<<0)     ; Ground
.equ OPAMP_MUXPOS_VDDDIV2_gc = (0x04<<0) ; VDD/2

; Positive Input Multiplexer select
.equ OPAMP_MUXPOS_LINKOUT_gc = (0x05<<0) ; Output from OP0

; Positive Input Multiplexer select
.equ OPAMP_MUXPOS_LINKWIP_gc = (0x06<<0) ; Wiper from OP0's resistor ladder

; Multiplexer Bottom select
.equ OPAMP_MUXBOT_OFF_gc = (0x00<<2)     ; Multiplexer off
.equ OPAMP_MUXBOT_INP_gc = (0x01<<2)     ; Positive input pin for OPn
.equ OPAMP_MUXBOT_INN_gc = (0x02<<2)     ; Negative input pin for OPn
.equ OPAMP_MUXBOT_DAC_gc = (0x03<<2)     ; DAC output
.equ OPAMP_MUXBOT_LINKOUT_gc = (0x04<<2) ; Link OP[n-1] output
.equ OPAMP_MUXBOT_GND_gc = (0x05<<2)     ; Ground

; Multiplexer Top select
.equ OPAMP_MUXTOP_OFF_gc = (0x00<<0)     ; Multiplexer off
.equ OPAMP_MUXTOP_OUT_gc = (0x01<<0)     ; OPn output
.equ OPAMP_MUXTOP_VDD_gc = (0x02<<0)     ; VDD

; Multiplexer Wiper selector
.equ OPAMP_MUXWIP_WIP0_gc = (0x00<<5)    ; R1 = 15R, R2 = 1R, R2/R1 = 0.07
.equ OPAMP_MUXWIP_WIP1_gc = (0x01<<5)    ; R1 = 14R, R2 = 2R, R2/R1 = 0.14
.equ OPAMP_MUXWIP_WIP2_gc = (0x02<<5)    ; R1 = 12R, R2 = 4R, R2/R1 = 0.33
.equ OPAMP_MUXWIP_WIP3_gc = (0x03<<5)    ; R1 = 8R, R2 = 8R, R2/R1 = 1
.equ OPAMP_MUXWIP_WIP4_gc = (0x04<<5)    ; R1 = 6R, R2 = 10R, R2/R1 = 1.67
.equ OPAMP_MUXWIP_WIP5_gc = (0x05<<5)    ; R1 = 4R, R2 = 12R, R2/R1 = 3
.equ OPAMP_MUXWIP_WIP6_gc = (0x06<<5)    ; R1 = 2R, R2 = 14R, R2/R1 = 7
.equ OPAMP_MUXWIP_WIP7_gc = (0x07<<5)    ; R1 = 1R, R2 = 15R, R2/R1 = 15

