ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DB64def.inc
; Input Range Select
.equ OPAMP_IRSEL_FULL_gc = (0x00<<0)     ; Full Input Range
.equ OPAMP_IRSEL_REDUCED_gc = (0x01<<0)  ; Reduced Input Range


;*************************************************************************
;** PORT - I/O Ports
;*************************************************************************

; PORT_INTFLAGS masks
.equ PORT_INT_gm = 0xFF                  ; Pin Interrupt Flag group mask
.equ PORT_INT_gp = 0                     ; Pin Interrupt Flag group position
.equ PORT_INT_0_bm = (1<<0)              ; Pin Interrupt Flag bit 0 mask
.equ PORT_INT_0_bp = 0                   ; Pin Interrupt Flag bit 0 position
.equ PORT_INT_1_bm = (1<<1)              ; Pin Interrupt Flag bit 1 mask
.equ PORT_INT_1_bp = 1                   ; Pin Interrupt Flag bit 1 position
.equ PORT_INT_2_bm = (1<<2)              ; Pin Interrupt Flag bit 2 mask
.equ PORT_INT_2_bp = 2                   ; Pin Interrupt Flag bit 2 position
.equ PORT_INT_3_bm = (1<<3)              ; Pin Interrupt Flag bit 3 mask
.equ PORT_INT_3_bp = 3                   ; Pin Interrupt Flag bit 3 position
.equ PORT_INT_4_bm = (1<<4)              ; Pin Interrupt Flag bit 4 mask
.equ PORT_INT_4_bp = 4                   ; Pin Interrupt Flag bit 4 position
.equ PORT_INT_5_bm = (1<<5)              ; Pin Interrupt Flag bit 5 mask
.equ PORT_INT_5_bp = 5                   ; Pin Interrupt Flag bit 5 position
.equ PORT_INT_6_bm = (1<<6)              ; Pin Interrupt Flag bit 6 mask
.equ PORT_INT_6_bp = 6                   ; Pin Interrupt Flag bit 6 position
.equ PORT_INT_7_bm = (1<<7)              ; Pin Interrupt Flag bit 7 mask
.equ PORT_INT_7_bp = 7                   ; Pin Interrupt Flag bit 7 position

; PORT_PORTCTRL masks
.equ PORT_SRL_bm = 0x01                  ; Slew Rate Limit Enable bit mask
.equ PORT_SRL_bp = 0                     ; Slew Rate Limit Enable bit position

; PORT_PINCONFIG masks
.equ PORT_ISC_gm = 0x07                  ; Input/Sense Configuration group mask
.equ PORT_ISC_gp = 0                     ; Input/Sense Configuration group position
.equ PORT_ISC_0_bm = (1<<0)              ; Input/Sense Configuration bit 0 mask
.equ PORT_ISC_0_bp = 0                   ; Input/Sense Configuration bit 0 position
.equ PORT_ISC_1_bm = (1<<1)              ; Input/Sense Configuration bit 1 mask
.equ PORT_ISC_1_bp = 1                   ; Input/Sense Configuration bit 1 position
.equ PORT_ISC_2_bm = (1<<2)              ; Input/Sense Configuration bit 2 mask
.equ PORT_ISC_2_bp = 2                   ; Input/Sense Configuration bit 2 position
.equ PORT_PULLUPEN_bm = 0x08             ; Pullup enable bit mask
.equ PORT_PULLUPEN_bp = 3                ; Pullup enable bit position
.equ PORT_INLVL_bm = 0x40                ; Input level select bit mask
.equ PORT_INLVL_bp = 6                   ; Input level select bit position
.equ PORT_INVEN_bm = 0x80                ; Inverted I/O Enable bit mask
.equ PORT_INVEN_bp = 7                   ; Inverted I/O Enable bit position

; PORT_PINCTRLUPD masks
.equ PORT_PINCTRLUPD_gm = 0xFF           ; Pin control update mask group mask
.equ PORT_PINCTRLUPD_gp = 0              ; Pin control update mask group position
.equ PORT_PINCTRLUPD_0_bm = (1<<0)       ; Pin control update mask bit 0 mask
.equ PORT_PINCTRLUPD_0_bp = 0            ; Pin control update mask bit 0 position
.equ PORT_PINCTRLUPD_1_bm = (1<<1)       ; Pin control update mask bit 1 mask
.equ PORT_PINCTRLUPD_1_bp = 1            ; Pin control update mask bit 1 position
.equ PORT_PINCTRLUPD_2_bm = (1<<2)       ; Pin control update mask bit 2 mask
.equ PORT_PINCTRLUPD_2_bp = 2            ; Pin control update mask bit 2 position
.equ PORT_PINCTRLUPD_3_bm = (1<<3)       ; Pin control update mask bit 3 mask
.equ PORT_PINCTRLUPD_3_bp = 3            ; Pin control update mask bit 3 position
.equ PORT_PINCTRLUPD_4_bm = (1<<4)       ; Pin control update mask bit 4 mask
.equ PORT_PINCTRLUPD_4_bp = 4            ; Pin control update mask bit 4 position
.equ PORT_PINCTRLUPD_5_bm = (1<<5)       ; Pin control update mask bit 5 mask
.equ PORT_PINCTRLUPD_5_bp = 5            ; Pin control update mask bit 5 position
.equ PORT_PINCTRLUPD_6_bm = (1<<6)       ; Pin control update mask bit 6 mask
.equ PORT_PINCTRLUPD_6_bp = 6            ; Pin control update mask bit 6 position
.equ PORT_PINCTRLUPD_7_bm = (1<<7)       ; Pin control update mask bit 7 mask
.equ PORT_PINCTRLUPD_7_bp = 7            ; Pin control update mask bit 7 position

; PORT_PINCTRLSET masks
.equ PORT_PINCTRLSET_gm = 0xFF           ; Pin control set mask group mask
.equ PORT_PINCTRLSET_gp = 0              ; Pin control set mask group position
.equ PORT_PINCTRLSET_0_bm = (1<<0)       ; Pin control set mask bit 0 mask
.equ PORT_PINCTRLSET_0_bp = 0            ; Pin control set mask bit 0 position
.equ PORT_PINCTRLSET_1_bm = (1<<1)       ; Pin control set mask bit 1 mask
.equ PORT_PINCTRLSET_1_bp = 1            ; Pin control set mask bit 1 position
.equ PORT_PINCTRLSET_2_bm = (1<<2)       ; Pin control set mask bit 2 mask
.equ PORT_PINCTRLSET_2_bp = 2            ; Pin control set mask bit 2 position
.equ PORT_PINCTRLSET_3_bm = (1<<3)       ; Pin control set mask bit 3 mask
.equ PORT_PINCTRLSET_3_bp = 3            ; Pin control set mask bit 3 position
.equ PORT_PINCTRLSET_4_bm = (1<<4)       ; Pin control set mask bit 4 mask
.equ PORT_PINCTRLSET_4_bp = 4            ; Pin control set mask bit 4 position
.equ PORT_PINCTRLSET_5_bm = (1<<5)       ; Pin control set mask bit 5 mask
.equ PORT_PINCTRLSET_5_bp = 5            ; Pin control set mask bit 5 position
.equ PORT_PINCTRLSET_6_bm = (1<<6)       ; Pin control set mask bit 6 mask
.equ PORT_PINCTRLSET_6_bp = 6            ; Pin control set mask bit 6 position
.equ PORT_PINCTRLSET_7_bm = (1<<7)       ; Pin control set mask bit 7 mask
.equ PORT_PINCTRLSET_7_bp = 7            ; Pin control set mask bit 7 position

; PORT_PINCTRLCLR masks
.equ PORT_PINCTRLCLR_gm = 0xFF           ; Pin control clear mask group mask
.equ PORT_PINCTRLCLR_gp = 0              ; Pin control clear mask group position
.equ PORT_PINCTRLCLR_0_bm = (1<<0)       ; Pin control clear mask bit 0 mask
.equ PORT_PINCTRLCLR_0_bp = 0            ; Pin control clear mask bit 0 position
.equ PORT_PINCTRLCLR_1_bm = (1<<1)       ; Pin control clear mask bit 1 mask
.equ PORT_PINCTRLCLR_1_bp = 1            ; Pin control clear mask bit 1 position
.equ PORT_PINCTRLCLR_2_bm = (1<<2)       ; Pin control clear mask bit 2 mask
.equ PORT_PINCTRLCLR_2_bp = 2            ; Pin control clear mask bit 2 position
.equ PORT_PINCTRLCLR_3_bm = (1<<3)       ; Pin control clear mask bit 3 mask
.equ PORT_PINCTRLCLR_3_bp = 3            ; Pin control clear mask bit 3 position
.equ PORT_PINCTRLCLR_4_bm = (1<<4)       ; Pin control clear mask bit 4 mask
.equ PORT_PINCTRLCLR_4_bp = 4            ; Pin control clear mask bit 4 position
.equ PORT_PINCTRLCLR_5_bm = (1<<5)       ; Pin control clear mask bit 5 mask
.equ PORT_PINCTRLCLR_5_bp = 5            ; Pin control clear mask bit 5 position
.equ PORT_PINCTRLCLR_6_bm = (1<<6)       ; Pin control clear mask bit 6 mask
.equ PORT_PINCTRLCLR_6_bp = 6            ; Pin control clear mask bit 6 position
.equ PORT_PINCTRLCLR_7_bm = (1<<7)       ; Pin control clear mask bit 7 mask
.equ PORT_PINCTRLCLR_7_bp = 7            ; Pin control clear mask bit 7 position

; PORT_PIN0CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN1CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

